import styles from "./Service.module.scss";
import Table from "./Table";
import Image from "next/image";
import service from "../../../public/Img/Service/service.jpg";

const tables = {
   table1: {
      thead: ["Тип техники", "Стоимость (с кронштейном)"],
      tbody: [
         {
            th1: "Кондиционер, BTU: 9-12",
            th2: "500 000 сум",
         },
         {
            th1: "Кондиционер, BTU: 18",
            th2: "550 000 сум",
         },
         {
            th1: "Кондиционер, BTU: 24",
            th2: "600 000 сум",
         },
         {
            th1: "Кондиционер, BTU: 24 (колонный)",
            th2: "650 000 сум",
         },
         {
            th1: "Кондиционер - колонный, BTU: 30-60",
            th2: "от 750 000 сум",
         },
      ],
   },
   table2: {
      thead: ["Наименование", "Стоимость, сум"],
      tbody: [
         {
            th1: "Профилактика внутреннего блока сплит-систем",
            th2: "130 000",
         },
         {
            th1: "Профилактика внутреннего блока, демонтаж и монтаж",
            th2: "250 000",
         },
         {
            th1: 'Профилактика внутреннего и внешнего блока при помощи "Karcher"',
            th2: "280 000",
         },
         {
            th1: "Профилактика колонной системы",
            th2: "330 000",
         },
         {
            th1: 'Профилактика колонного кондиционера (внутр. и внеш. блок) и чистка при помощи "Karcher"',
            th2: "400 000",
         },
         {
            th1: "Заправка фреоном R-22  1 кг",
            th2: "400 000",
         },
         {
            th1: "Заправка фреоном R-410  1 кг",
            th2: "450 000",
         },
         {
            th1: "Замена датчика Термостата с работой",
            th2: "230 000",
         },
         {
            th1: "Ремонт электронной платы",
            th2: "400 000",
         },
         {
            th1: "Сварочная работа, 1 точка",
            th2: "80 000",
         },
         {
            th1: "Устранение утечки системы",
            th2: "200 000",
         },
         {
            th1: "Демонтаж",
            th2: "От 150 000",
         },
         {
            th1: "Замена конденсатора 09/12/18",
            th2: "25 0000",
         },
         {
            th1: "Замена конденсатора 09/12/18",
            th2: "300 000",
         },
         {
            th1: "Перефазировка",
            th2: "150 000",
         },
         {
            th1: "Удлинение трубки на 1 метр  09/12/18 BTU",
            th2: "85 000",
         },
         {
            th1: "Удлинение трубки на 1 метр  24 BTU",
            th2: "120 000",
         },
         {
            th1: "Штроба под трассу 60х60 красный кирпич, пеноблок, гипсобллок и т. п.",
            th2: "60 000",
         },
         {
            th1: "Штроба под трассу60х60 в бетоне",
            th2: "120 000",
         },
         {
            th1: "Бурение доп. Отверстия",
            th2: "65 000",
         },
         {
            th1: "Автовышка",
            th2: "По договоренности",
         },
         {
            th1: "Выезд за пределы ТКАД 1 км",
            th2: "1 500",
         },
         {
            th1: "Выезд на калькуляцию: замер, осмотр, разметка",
            th2: "100 000",
         },
         {
            th1: "Установка кондиционера в 2 этапа",
            th2: "50 000",
         },
      ],
   },
   table3: {},
};

function Service() {
   return (
      <div className={styles.service__container}>
         <h1 className={styles.service__title}>Закажи у нас установку кондиционера в Ташкенте</h1>
         <div className={styles.service__img}>
            <Image src={service} alt="Сервис" fill style={{ objectFit: "cover" }} />
         </div>
         <p className={styles.service__subtitle}>
            Наша компания предоставляет нашим клиентам услуги по установке кондиционера. Правильный монтаж кондиционера, должны проводить специалисты, имеющие
            лицензию на установку кондиционеров, с соблюдением инструкции и с применением спецтехники.
         </p>
         <div className={styles.service__tables}>
            <h2 className={styles.service__tables__title}>Стоимость монтажа бытовых кондиционеров</h2>
            <Table table={tables.table1} />
            <h2 className={styles.service__tables__title}>Дополнительные работы</h2>
            <Table table={tables.table2} />
         </div>
      </div>
   );
}
export default Service;
